mochaBlanc/Machine-vision-based-automatic-patrol-smart-car-system/my_drivers/src/stm32f10x_STMADC.c



#include "stm32f10x_STMADC.h"

/******************************************************************************
*                                                                             *
* @defgroup SENSOR_Import_Variables                                  *
* @{                                                                          *
*                                                                             *
******************************************************************************/ 
extern  STMADC_Hardware_TypeDef_Struct STMADC_Hardware[];


/******************************************************************************
*                                                                             *
* @defgroup SENSOR_Private_Variables                                 *
* @{                                                                          *
*                                                                             *
******************************************************************************/ 
typedef struct __STMADC_Inner_Struct
{
	FlagStatus          Infreshed;
	FlagStatus          Outfreshed;	
  uint16_t            AD_data; 
} STMADC_Inner_Struct;




/* ------------------------- SENSOR_BASE -------------------------- */
STMADC_TypeDef_Struct         STMADC1_BASE,STMADC2_BASE,STMADC3_BASE,STMADC4_BASE;
STMADC_Inner_Struct           Inner_STMADC1,Inner_STMADC2,Inner_STMADC3,Inner_STMADC4;
                             


uint16_t AD_data[2];
                              

/******************************************************************************
* @brief  Initializes the GPIO of SENSORx                                     *
* @param  SENSORx: where x can be 1 to SENSOR_NUM_USED  to                    * 
*         select the SENSOR.SENSOR_NUM_USED is defined at                     *
*         SENSORx.h, can be 1 to SENSOR_NUM_MAX, and                          *
*         SENSOR_NUM_MAX is also defined at SENSORx.h,                        *
*         can be 1 to 4.                                                      *
* @param    
*          																			                              *
* @retval : ERROR or SUCCESS.                                                 *
******************************************************************************/ 

ErrorStatus STMADC_GPIOConfig(STMADC_TypeDef_Struct *STMADCx);

/******************************************************************************
* @brief  judge the validity  of SENSORx                                      *
* @param  SENSORx: where x can be 1 to SENSOR_NUM_USED  to                    * 
*         select the SENSOR.SENSOR_NUM_USED is defined at                     *
*         SENSORx.h, can be 1 to SENSOR_NUM_MAX, and                          *
*         SENSOR_NUM_MAX is also defined at SENSORx.h,                        *
*         can be 1 to 4.                                                      *
* @param    
*          																			                              *
* @retval : ERROR or SUCCESS.                                                 *
******************************************************************************/ 

ErrorStatus STMADC_VALID(STMADC_TypeDef_Struct* STMADCx);



/******************************************************************************
* @brief  start convert SENSORx                                     					*
* @param  SENSORx: where x can be 1 to SENSOR_NUM_USED  to                    * 
*         select the SENSOR.SENSOR_NUM_USED is defined at                     *
*         SENSORx.h, can be 1 to SENSOR_NUM_MAX, and                          *
*         SENSOR_NUM_MAX is also defined at SENSORx.h,                        *
*         can be 1 to 4.                                                      *
* @param    
*          																			                              *
* @retval : ERROR or SUCCESS.                                                 *
******************************************************************************/
void STMADC_CMD(STMADC_TypeDef_Struct* STMADCx);


/******************************************************************************
* @brief  ADC Convert Tick, users must call this function in fixed time       *
*         interval to start AD convert, the fixed time interval is no less    *
*         than 100us .              																			    *
*         The switching sequence:  STMADC1  to STMADC4                				*
*                                 																						*
* @param  void                                                      					*
*         																		                                *
* @retval : void                                              								*
******************************************************************************/ 
void STMADC_Convert_Tick(void);


static uint32_t __STMADC_CPU_PRIMASK_REG_SAVE_VALUE;

static __INLINE void __STMADC_Disable_IRQ(void);
static __INLINE void __STMADC_Restore_IRQ(void);

/******************************************************************************
* @brief  Fills each SENSOR_InitStruct member with its default value.*
* @param  SENSOR_InitStruct:pointer to a SENSOR_InitTypeDef *
*         structure which will be initialized.                                *
* @retval : None                                                              *
******************************************************************************/ 
void STMADC_StructInit(STMADC_InitTypeDef_Struct* STMADCx_InitStruct)
{ 	
	/*---------------------- Set the default configuration ----------------------*/
  STMADCx_InitStruct->ADCenable                                        = STMADC_ENABLE_DEFAULT;
	STMADCx_InitStruct->DMAenable																				=STMADC_DMA_ENABLE_DEFAULT;

}
/******************************************************************************
* @brief  Initializes the SENSORx according to the specified.        *
* @param  SENSORx: where x can be 1 to SENSOR_NUM_USED  to  * 
*         select the SENSOR.SENSOR_NUM_USED is defined at   *
*         SENSORx.h, can be 1 to SENSOR_NUM_MAX, and        *
*         SENSOR_NUM_MAX is also defined at SENSORx.h,      *
*         can be 1 to 4.                                                      *
* @param  SENSOR_InitStruct: pointer to a SENSOR_InitTypeDef*
*         structure which will be initialized.                                *
* @retval : ERROR or SUCCESS.                                                 *
******************************************************************************/ 
ErrorStatus STMADCx_Init(STMADC_TypeDef_Struct* STMADCx,STMADC_InitTypeDef_Struct* STMADCx_InitStruct)
{
  ErrorStatus         err;
	uint16_t            ADC1_enable,ADC2_enable;
  uint16_t            ii = 300;	
  ADC_InitTypeDef     ADC_InitStructure;
	DMA_InitTypeDef     DMA_InitStructure;	
	
  if  ((STMADCx == NULL) || (STMADCx_InitStruct == NULL)) return ERROR;
  
