mochaBlanc/Machine-vision-based-automatic-patrol-smart-car-system/my_drivers/src/stm32f10x_STMADC.c
/*------ SENSOR_BASE->SENSOR_Hardware Configuration -------*/
  if (STMADCx == STMADC1)
     STMADC1_BASE.STMADC_Hardware = &STMADC_Hardware[0];
  else if (STMADCx == STMADC2)
     STMADC2_BASE.STMADC_Hardware = &STMADC_Hardware[1];
  else if (STMADCx == STMADC3)
     STMADC3_BASE.STMADC_Hardware = &STMADC_Hardware[2];
  else if (STMADCx == STMADC4)
     STMADC4_BASE.STMADC_Hardware = &STMADC_Hardware[3];	
  else 
    return ERROR;

  
/*------------------------ SENSOR_InitConfig ---------------------- */  

	STMADCx->STMADC_Mem.ADCenable        = STMADCx_InitStruct->ADCenable;
	if(STMADCx ->STMADC_Hardware->STMADCx_DMA_Channelx==NULL)
		STMADCx ->STMADC_Mem.DMAenable=DISABLE;
	else 
	STMADCx->STMADC_Mem.DMAenable=STMADCx_InitStruct->DMAenable;
	
  if (STMADCx == STMADC1)
	{		
		 if(STMADC1->STMADC_Mem.ADCenable == ENABLE)
		 {
        if(STMADC1->STMADC_Hardware->STMADCx == ADC1)  
			    ADC1_enable ++;
        if(STMADC1->STMADC_Hardware->STMADCx == ADC2)  
			    ADC2_enable ++;				
     }	
		 
		 Inner_STMADC1.Infreshed                = RESET;
		 Inner_STMADC1.Outfreshed               = RESET;		 

  }	
  else if (STMADCx == STMADC2)
	{
     STMADC2->STMADC_Mem.ADCenable        = STMADCx_InitStruct->ADCenable;
		 if(STMADC2->STMADC_Mem.ADCenable == ENABLE)
		 {
        if(STMADC2->STMADC_Hardware->STMADCx == ADC1)  
			    ADC1_enable ++;
        if(STMADC2->STMADC_Hardware->STMADCx == ADC2)  
			    ADC2_enable ++;		
			}	
			Inner_STMADC2.Infreshed                = RESET;
			Inner_STMADC2.Outfreshed               = RESET;		 

  }	
  else if (STMADCx == STMADC3)
	{
     STMADC3->STMADC_Mem.ADCenable        = STMADCx_InitStruct->ADCenable;
		 if(STMADC3->STMADC_Mem.ADCenable == ENABLE)
		 {
        if(STMADC3->STMADC_Hardware->STMADCx == ADC1)  
			    ADC1_enable ++;
        if(STMADC3->STMADC_Hardware->STMADCx == ADC2)  
			    ADC2_enable ++;				
     }
		 Inner_STMADC3.Infreshed                = RESET;
		 Inner_STMADC3.Outfreshed               = RESET;		 
  }	
  else if (STMADCx == STMADC4)
	{
     STMADC4->STMADC_Mem.ADCenable        = STMADCx_InitStruct->ADCenable;
		 if(STMADC4->STMADC_Mem.ADCenable == ENABLE)
		 {
        if(STMADC4->STMADC_Hardware->STMADCx == ADC1)  
			    ADC1_enable ++;
        if(STMADC4->STMADC_Hardware->STMADCx == ADC2)  
			    ADC2_enable ++;				
     }
		 Inner_STMADC4.Infreshed                = RESET;
		 Inner_STMADC4.Outfreshed               = RESET;		 
  }	
	
	
	 err = STMADC_GPIOConfig(STMADCx);
	
  if(ADC1_enable == 0x01)
  {
    /* ------------¡ª---------------- ADC configuration ------------------------- */
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_ADC1, ENABLE);  
   	RCC_ADCCLKConfig(RCC_PCLK2_Div6);
  
    ADC_DeInit(STMADCx->STMADC_Hardware->STMADCx);
    ADC_InitStructure.ADC_Mode = ADC_Mode_Independent;
    ADC_InitStructure.ADC_ScanConvMode = DISABLE;
    ADC_InitStructure.ADC_ContinuousConvMode = DISABLE;
    ADC_InitStructure.ADC_ExternalTrigConv = ADC_ExternalTrigConv_None;
    ADC_InitStructure.ADC_DataAlign = ADC_DataAlign_Right;
    ADC_InitStructure.ADC_NbrOfChannel = 1;
    ADC_Init(STMADCx->STMADC_Hardware->STMADCx, &ADC_InitStructure);
		  

    ADC_Cmd(STMADCx->STMADC_Hardware->STMADCx, ENABLE);
		
    ADC_ResetCalibration(STMADCx->STMADC_Hardware->STMADCx);
    while(ADC_GetResetCalibrationStatus(STMADCx->STMADC_Hardware->STMADCx));
    ADC_StartCalibration(STMADCx->STMADC_Hardware->STMADCx);
    while(ADC_GetCalibrationStatus(STMADCx->STMADC_Hardware->STMADCx));
		
		if(STMADC1->STMADC_Hardware->STMADCx == ADC1)
		{
         STMADC_CMD(STMADC1); 
    }
		
		/*Init_DMA*/
	if((STMADCx->STMADC_Hardware->STMADC_Channel!=NULL)&&(STMADCx->STMADC_Hardware->STMADCx_DMA_Channelx!=NULL))
	{
		if(STMADCx->STMADC_Mem.DMAenable==ENABLE)
		{
		DMA_DeInit(STMADCx->STMADC_Hardware->STMADCx_DMA_Channelx);    /* DMA1 Channel1 Config */
    DMA_InitStructure.DMA_PeripheralBaseAddr = (uint32_t)&ADC1->DR;
    DMA_InitStructure.DMA_MemoryBaseAddr = (uint32_t)&AD_data;
    DMA_InitStructure.DMA_DIR = DMA_DIR_PeripheralSRC;
    DMA_InitStructure.DMA_BufferSize = 2;
    DMA_InitStructure.DMA_PeripheralInc = DMA_PeripheralInc_Disable;
    DMA_InitStructure.DMA_MemoryInc = DMA_MemoryInc_Enable;
    DMA_InitStructure.DMA_PeripheralDataSize = DMA_PeripheralDataSize_HalfWord;
    DMA_InitStructure.DMA_MemoryDataSize = DMA_MemoryDataSize_HalfWord;
    DMA_InitStructure.DMA_Mode = DMA_Mode_Circular;
    DMA_InitStructure.DMA_Priority = DMA_Priority_High;
    DMA_InitStructure.DMA_M2M = DMA_M2M_Disable;
		
    DMA_Init(STMADCx->STMADC_Hardware->STMADCx_DMA_Channelx, &DMA_InitStructure);
		}
	}
	
	
		if((STMADCx->STMADC_Hardware->STMADC_Channel!=NULL)&&(STMADCx->STMADC_Hardware->STMADCx_DMA_Channelx!=NULL))
		{		 
			if(STMADCx->STMADC_Mem.DMAenable==ENABLE)
			{/* Enable ADC1 DMA */ 
				ADC_DMACmd(STMADCx->STMADC_Hardware->STMADCx, ENABLE);  
				DMA_Cmd(STMADCx->STMADC_Hardware->STMADCx_DMA_Channelx, ENABLE);			
			}
		}
	
		while(ii--);	
  }
	
	if(ADC2_enable == 0x01)
  {
    /* ------------¡ª---------------- ADC configuration ------------------------- */
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_ADC2, ENABLE);       			
   	RCC_ADCCLKConfig(RCC_PCLK2_Div6);
  
    ADC_DeInit(STMADCx->STMADC_Hardware->STMADCx);
    ADC_InitStructure.ADC_Mode = ADC_Mode_Independent;
    ADC_InitStructure.ADC_ScanConvMode = DISABLE;
    ADC_InitStructure.ADC_ContinuousConvMode = DISABLE;
    ADC_InitStructure.ADC_ExternalTrigConv = ADC_ExternalTrigConv_None;
    ADC_InitStructure.ADC_DataAlign = ADC_DataAlign_Right;
    ADC_InitStructure.ADC_NbrOfChannel = 1;
    ADC_Init(STMADCx->STMADC_Hardware->STMADCx, &ADC_InitStructure);

    ADC_Cmd(STMADCx->STMADC_Hardware->STMADCx, ENABLE);
    ADC_ResetCalibration(STMADCx->STMADC_Hardware->STMADCx);
    while(ADC_GetResetCalibrationStatus(STMADCx->STMADC_Hardware->STMADCx));
    ADC_StartCalibration(STMADCx->STMADC_Hardware->STMADCx);
    while(ADC_GetCalibrationStatus(STMADCx->STMADC_Hardware->STMADCx));
		
		if(STMADC1->STMADC_Hardware->STMADCx == ADC2)
		{
         STMADC_CMD(STMADC1); 
    }
		while(ii--);
  }	

		
