mochaBlanc/Machine-vision-based-automatic-patrol-smart-car-system/my_drivers/src/stm32f10x_STMADC.c
  return err;
}

/******************************************************************************
* @brief  Open STMADCx                         	      		              	    *
* @param  STMADCx: where x can be  1 to STMADC_NUM_MAX   				  					  *
*         to select the STMADC_USE_DEFAULT is defined at                      *
*         SENSOR.h,can be 1 to SENSOR_NUM_MAX,and                             *
*         SENSOR_NUM_MAX is also defined at SENSOR.h,                         *
*         can be 1 to 4.                                                      *
* @param                                                                      *
*                                                                             *
* @retval : ERROR or SUCCESS.                                                 *
******************************************************************************/ 
ErrorStatus STMADC_Open(STMADC_TypeDef_Struct* STMADCx)
{
  if (STMADC_VALID(STMADCx) == ERROR) return ERROR;
		
  if (STMADCx == STMADC1)
     STMADC1->STMADC_Mem.ADCenable      = ENABLE;
  else if (STMADCx == STMADC2)
     STMADC2->STMADC_Mem.ADCenable      = ENABLE;
  else if (STMADCx == STMADC3)
     STMADC3->STMADC_Mem.ADCenable      = ENABLE;
  else if (STMADCx == STMADC4)
     STMADC4->STMADC_Mem.ADCenable      = ENABLE;
  else 
    return ERROR;	

 return SUCCESS;
}

/******************************************************************************
* @brief  Close STMADCx                         	      		              	  *
* @param  STMADCx: where x can be  1 to STMADC_NUM_MAX   				  					  *
*         to select the STMADC_USE_DEFAULT is defined at                      *
*         SENSOR.h,can be 1 to SENSOR_NUM_MAX,and                             *
*         SENSOR_NUM_MAX is also defined at SENSOR.h,                         *
*         can be 1 to 4.                                                      *
* @param                                                                      *
*                                                                             *
* @retval : ERROR or SUCCESS.                                                 *
******************************************************************************/ 
ErrorStatus STMADC_Close(STMADC_TypeDef_Struct* STMADCx)
{
  if (STMADC_VALID(STMADCx) == ERROR) return ERROR;
		
  if (STMADCx == STMADC1)
	{
		STMADC1->STMADC_Mem.ADCenable   = DISABLE;
		
	}
  else if (STMADCx == STMADC2)
     STMADC2->STMADC_Mem.ADCenable      = DISABLE;
  else if (STMADCx == STMADC3)
     STMADC3->STMADC_Mem.ADCenable      = DISABLE;
  else if (STMADCx == STMADC4)
     STMADC4->STMADC_Mem.ADCenable      = DISABLE;
  else 
    return ERROR;	

 return SUCCESS;
}

ErrorStatus STMADC_Read_data(STMADC_TypeDef_Struct* STMADCx,STMADC_DATA_Struct* Adcdata)
{
	if(STMADCx == NULL)    return  ERROR;
	
	if (STMADCx  == STMADC1)
	{
      if(Inner_STMADC1.Outfreshed == SET)
      {
          Adcdata->freshed  = SET;			
					Adcdata->AD_data 	=Inner_STMADC1.AD_data;	
          Inner_STMADC1.Outfreshed = RESET;
      }
			else
			    Adcdata->freshed  = RESET;
  }
	else if (STMADCx  == STMADC2)
	{
      if(Inner_STMADC2.Outfreshed == SET)
      {
          Adcdata->freshed  = SET;	
					Adcdata->AD_data 	=Inner_STMADC2.AD_data;					
          Inner_STMADC2.Outfreshed = RESET;
      }
			else
			    Adcdata->freshed  = RESET;
  }
	else if (STMADCx  == STMADC3)
	{
      if(Inner_STMADC3.Outfreshed == SET)
      {
          Adcdata->freshed  = SET;
					Adcdata->AD_data 	=Inner_STMADC3.AD_data;					
          Inner_STMADC3.Outfreshed = RESET;
      }
			else
			    Adcdata->freshed  = RESET;
  }
	else if (STMADCx  == STMADC4)
	{
      if(Inner_STMADC4.Outfreshed == SET)
      {
          Adcdata->freshed  = SET;
					Adcdata->AD_data 	=Inner_STMADC4.AD_data;					
          Inner_STMADC4.Outfreshed = RESET;
      }
			else
			    Adcdata->freshed  = RESET;
  }
}

ErrorStatus  STMADC_Read_vol_data(STMADC_TypeDef_Struct* STMADCx,uint16_t* voltage)
{
  if(STMADCx == NULL)   return  ERROR;
	if (STMADCx  == STMADC1)
	{
    *voltage=(AD_data[0]*3.3*11/4096)*100; 
  }
	else return  ERROR;
	
} 

/******************************************************************************
*                                                                             *
* @defgroup SENSOR_Private_Function                                           *
* @{                                                                          *
*                                                                             *
******************************************************************************/ 
void ADC_GetData(STMADC_TypeDef_Struct* STMADCx)
{
	  uint16_t    Adc_data;
	
    if( ADC_GetFlagStatus(STMADCx->STMADC_Hardware->STMADCx, ADC_FLAG_EOC) == 1)
		{
				Adc_data = ADC_GetConversionValue(STMADCx->STMADC_Hardware->STMADCx);

				if(Adc_data      >= STMADC_DATA_MAX)
				{
					Adc_data        = STMADC_DATA_MAX;
				}
				else if(Adc_data <= STMADC_DATA_MIN)
				{
					Adc_data        = STMADC_DATA_MIN;  
				}
				
	      __STMADC_Disable_IRQ();
        if(STMADCx == STMADC1)
				{
            Inner_STMADC1.Infreshed   = SET;
            Inner_STMADC1.Outfreshed  = SET;					
					  Inner_STMADC1.AD_data     = Adc_data;
        }
        else if(STMADCx == STMADC2)
				{
            Inner_STMADC2.Infreshed     = SET;
            Inner_STMADC2.Outfreshed  = SET;						
					  Inner_STMADC2.AD_data     = Adc_data;
        }
        else if(STMADCx == STMADC3)
				{
            Inner_STMADC3.Infreshed     = SET;
            Inner_STMADC3.Outfreshed  = SET;						
					  Inner_STMADC3.AD_data     = Adc_data;
        }				
				else if(STMADCx == STMADC4)
				{
            Inner_STMADC4.Infreshed     = SET;
            Inner_STMADC4.Outfreshed  = SET;						
					  Inner_STMADC4.AD_data     = Adc_data;
        }
        __STMADC_Restore_IRQ();
				
				ADC_ClearFlag(STMADCx->STMADC_Hardware->STMADCx, ADC_FLAG_EOC);
		}	
		else
		{
        if(STMADCx == STMADC1)
				{
            Inner_STMADC1.Infreshed   = RESET;
        }
        else if(STMADCx == STMADC2)
				{
            Inner_STMADC2.Infreshed   = RESET;
        }
        else if(STMADCx == STMADC3)
				{
            Inner_STMADC3.Infreshed   = RESET;
        }				
				else if(STMADCx == STMADC4)
				{
            Inner_STMADC4.Infreshed   = RESET;
        }	
		}				
				
