mochaBlanc/Machine-vision-based-automatic-patrol-smart-car-system/my_drivers/src/stm32f10x_STMADC.c
}
/******************************************************************************
*                                                                             *
* @defgroup SENSOR_Private_Function                                           *
* @{                                                                          *
*                                                                             *
******************************************************************************/ 

ErrorStatus STMADC_VALID(STMADC_TypeDef_Struct* STMADCx)
{	
	if ((STMADCx == NULL) ||(STMADCx->STMADC_Hardware->STMADCx == STMADC_NULL) ||
		                  (STMADCx->STMADC_Hardware->STMADC_GPIOx == STMADC_GPIO_NULL) ||
	                (STMADCx->STMADC_Hardware->STMADC_GPIO_Pin == STMADC_GPIO_Pin_NULL))
      return ERROR;
	else 
    return SUCCESS;

}	
void STMADC_CMD(STMADC_TypeDef_Struct* STMADCx)
{
  if(STMADCx == STMADC1)
	{
		if((STMADC_VALID(STMADC1)!= ERROR)&&(STMADC1->STMADC_Mem.ADCenable == ENABLE))
		{
			 ADC_RegularChannelConfig(STMADC1->STMADC_Hardware->STMADCx, 
																								 STMADC1->STMADC_Hardware->STMADC_Channel,
																								 1, ADC_SampleTime_239Cycles5);
			 ADC_SoftwareStartConvCmd(STMADC1->STMADC_Hardware->STMADCx,ENABLE);
			
			
		
  }
}
	else if(STMADCx == STMADC2)
	{
		if((STMADC_VALID(STMADC2)!= ERROR)&&(STMADC2->STMADC_Mem.ADCenable == ENABLE))
		{
			 ADC_RegularChannelConfig(STMADC2->STMADC_Hardware->STMADCx, 
																								 STMADC2->STMADC_Hardware->STMADC_Channel,
																								 1, ADC_SampleTime_239Cycles5);
			 ADC_SoftwareStartConvCmd(STMADC2->STMADC_Hardware->STMADCx,ENABLE);
		}
  }
	else if(STMADCx == STMADC3)
	{
		if((STMADC_VALID(STMADC3)!= ERROR)&&(STMADC3->STMADC_Mem.ADCenable == ENABLE))
		{
			 ADC_RegularChannelConfig(STMADC3->STMADC_Hardware->STMADCx, 
																								 STMADC3->STMADC_Hardware->STMADC_Channel,
																								 1, ADC_SampleTime_239Cycles5);
			 ADC_SoftwareStartConvCmd(STMADC3->STMADC_Hardware->STMADCx,ENABLE);
		}
  }	
	else if(STMADCx == STMADC4)
	{
		if((STMADC_VALID(STMADC4)!= ERROR)&&(STMADC4->STMADC_Mem.ADCenable == ENABLE))
		{
			 ADC_RegularChannelConfig(STMADC4->STMADC_Hardware->STMADCx, 
																								 STMADC4->STMADC_Hardware->STMADC_Channel,
																								 1, ADC_SampleTime_239Cycles5);
			 ADC_SoftwareStartConvCmd(STMADC4->STMADC_Hardware->STMADCx,ENABLE);
		}
  }	
}	




ErrorStatus STMADC_GPIOConfig(STMADC_TypeDef_Struct *STMADCx)
{    
  GPIO_InitTypeDef GPIO_InitStructure;  

  if (STMADC_VALID(STMADCx) == ERROR) return ERROR;  
	
  /* SENSOR GPIO Configuration */
  GPIO_InitStructure.GPIO_Pin  = STMADCx->STMADC_Hardware->STMADC_GPIO_Pin;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AIN;;	
  GPIO_Init(STMADCx->STMADC_Hardware->STMADC_GPIOx,&GPIO_InitStructure);
	
	

  return SUCCESS;
}


		




void STMADC_Convert_Tick(void)
{  
	static    uint64_t time = 0;

	
  if(time == 0xffffffffffffffff)
  {
    time = 0x00;
  }    

  switch (STMADC_USED)
	{
    case 1:
	    if(time%STMADC_USED == 0x00)
	    {
					ADC_GetData(STMADC1);					
					STMADC_CMD(STMADC1);     //start ADC1									
			}			
		  break;
    case 2:
	    if(time%STMADC_USED == 0x00)
	    {		
					ADC_GetData(STMADC1);					
					STMADC_CMD(STMADC2);     //start ADC2		
									
			}		
	    if(time%STMADC_USED == 0x01)
	    {
				  ADC_GetData(STMADC2);
				  STMADC_CMD(STMADC1);     //start ADC1						
			}								
		  break;
    case 3:
	    if(time%STMADC_USED == 0x00)
	    {		
					ADC_GetData(STMADC1);
				  STMADC_CMD(STMADC2);     //start ADC2				
			}		
	    if(time%STMADC_USED == 0x01)
	    {
				  ADC_GetData(STMADC2);
				  STMADC_CMD(STMADC3);     //start ADC3						
			}	
	    if(time%STMADC_USED == 0x02)
	    {
					ADC_GetData(STMADC3);
				  STMADC_CMD(STMADC1);     //start ADC1					
			}			
		  break;
    case 4:
	    if(time%STMADC_USED == 0x00)
	    {	
					ADC_GetData(STMADC1);
				  STMADC_CMD(STMADC2);     //start ADC2					
			}		
	    if(time%STMADC_USED == 0x01)
	    {
					ADC_GetData(STMADC2);
				  STMADC_CMD(STMADC3);     //start ADC3					
			}	
	    if(time%STMADC_USED == 0x02)
	    {
					ADC_GetData(STMADC3);
				  STMADC_CMD(STMADC4);     //start ADC4					
			}	
	    if(time%STMADC_USED == 0x03)
	    {
				ADC_GetData(STMADC4);
				STMADC_CMD(STMADC1);     //start ADC1				
			}				
		  break;
			    default: 
			break;		
  }
  time++;	

}	



static __INLINE void __STMADC_Disable_IRQ(void)
{
	  __STMADC_CPU_PRIMASK_REG_SAVE_VALUE = __get_PRIMASK();
	  __disable_irq();
}
static __INLINE void __STMADC_Restore_IRQ(void)
{
	  __set_PRIMASK(__STMADC_CPU_PRIMASK_REG_SAVE_VALUE);
}
/****************************  end   **************************************************/